Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་བྱམས་པ་ལ་མཉམ་པར་གཞག་གོ །
en: Now I should become absorbed in loving kindness.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་བྱམས་པ་ལ་དགོད་དོ།
en: I should also establish all beings in loving kindness.

source: །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་ལ་མཉམ་པར་གཞག་གོ །
en: Now I should be absorbed in compassion, empathetic joy, and equanimity.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་བཏང་སྙོམས་ལ་དགོད་དོ།
en: I should also establish all beings in equanimity [and so forth].

source: །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་མཉམ་པར་གཞག་གོ །
en: Now I should be absorbed in the sphere of infinite space.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལ་དགོད་དོ།
en: I should also establish all beings in the sphere of infinite space.

source: །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་མཉམ་པར་གཞག་གོ །
en: Now I should be absorbed in the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་དགོད་དོ།
en: I should also establish all beings in the sphere of neither perception nor nonperception [and so forth]. “ ‘

source: །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་བསྒོམ་པར་བྱའོ།
en: Now I should cultivate the applications of mindfulness.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་དགོད་དོ། །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་ཡང་དག་པར་སྤོང་བ་དང་།
en: I should also establish all beings in the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་བསྒོམ་པར་བྱའོ།
en: Now I should cultivate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་དགོད་དོ།
en: I should also establish all beings in the noble eightfold path [and so forth].

source: །མ་ལ་བདག་ཉིད་ཀྱིས་ཀྱང་རྣམ་པར་ཐར་བའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་བསྒོམ་པར་བྱའོ།
en: Now I should cultivate the gateways of liberation—emptiness, signlessness, and wishlessness.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱང་རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ལ་དགོད་དོ།
en: I should also establish all beings in the gateways of liberation—emptiness, signlessness, and wishlessness.’ “

source: །སྙམ་སྟེ་དེ་དེ་ལྟར་སེམས་པའི་ཚེ། དེ་འདི་སྙམ་དུ་དགེ་བའི་རྩ་བ་འདིས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་སེམས་ཅན་ཐམས་ཅད་བསམ་གཏན་བཞི་དང་མི་འབྲལ་ཞིང་། ཚད་མེད་པ་བཞི་དང་མི་འབྲལ་བ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་།
en: When they think in that manner, they should also reflect, ‘Through these roots of virtuous action, may all beings of this buddhafield where I attain consummate buddhahood in unsurpassed, complete enlightenment not be separated from the four meditative concentrations, may they not be separated from the four immeasurable attitudes, and may they not be separated from the four formless absorptions, the thirty-seven factors conducive to enlightenment, {Ki.

source: རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དག་དང་མི་འབྲལ་བར་ཤོག་ཤིག་ཅེས་བྱ་བར་སེམས་བསྐྱེད་དོ།
en: VIII: 129} or the gateways of liberation—emptiness, signlessness, and wishlessness!’ “

source: །རབ་འབྱོར་དེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དེ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, they will refine the buddhafields.

source: དེ་ནམ་བསམས་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་མ་གྱུར་གྱི་བར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ།
en: They will not attain consummate buddhahood in unsurpassed, complete enlightenment until all these wishes have been fulfilled.

source: དེ་བདག་ཉིད་ཀྱང་དགེ་བའི་རྩ་བ་ཐམས་ཅད་དང་ལྡན་པ་ཡིན། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་དགེ་བའི་རྩ་བ་དང་ལྡན་པར་བྱེད་པ་ཡིན་ཏེ།
en: They themselves will possess all the roots of virtuous action, and they will also cause all those beings to possess the roots of virtuous action.

source: དེ་བདག་ཉིད་ཀྱི་ལུས་ཀྱང་མཛེས་པ་ཡིན། སེམས་ཅན་གང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཡོངས་སུ་སྨིན་པར་བྱས་པ་དེ་དག་ཀྱང་འདི་ལྟ་སྟེ། བསོད་ནམས་ཀྱིས་ཡོངས་སུ་བཟུང་བའི་ཕྱིར། གཟུགས་བཟང་ཞིང་མཛེས་ལ་ཡིད་དུ་འོང་བའི་གཟུགས་མངོན་པར་འགྲུབ་སྟེ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལྟར་ཡོངས་སུ་དག་པར་བྱེད་དེ།
en: Their own body will be beautiful and the beings who have been brought to maturation by those bodhisattva great beings will also manifest a noble, beautiful, and pleasant physical appearance because they have been favored by their merits.

source: ཅི་ནས་ཀྱང་ངན་སོང་གསུམ་དུ་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། ལྟ་བའི་རྣམ་པར་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། འདོད་ཆགས་དང་ཞེ་སྡང་དང་། གཏི་མུག་ཏུ་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། བུད་མེད་དང་། སྐྱེས་པར་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། ཐེག་པ་གཉིས་སུ་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། མི་རྟག་པ་དང་སྡུག་བསྔལ་བ་དང་། བདག་མེད་པར་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། ཡོངས་སུ་འཛིན་པར་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། བདག་དང་བདག་གིར་བྱ་བར་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། བག་ལ་ཉལ་བ་དང་ཀུན་ནས་ལྡང་བར་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་། ཕྱིན་ཅི་ལོག་ཏུ་གདགས་པའི་མིང་ཡང་མི་སྲིད་པ་དང་།
en: Subhūti, bodhisattva great beings will refine the buddhafields in that manner, such that by any means even the concept of ‘three lower realms’ will no longer exist; even the concept of ‘false views’ will no longer exist; even the concept of ‘desire, hatred, and delusion’ will no longer exist; even the concept of ‘women and men’ will no longer exist; even the concept of ‘the two vehicles’ will no longer exist; even the concept of ‘impermanence, suffering, and nonself’ will no longer exist; even the concept of ‘recipient’ will no longer exist; even the concept of ‘I and mine’ will no longer exist; even the concept of ‘latent impulses and obsessions’ will no longer exist; even the concept of ‘erroneous views’ will no longer exist; and even the concept of the ‘fruits’ will no longer exist.

source: འབྲས་བུར་གདགས་པའི་མིང་ཡང་མི་སྲིད་ཅིང་གཞན་དུ་ན་སེམས་ཅན་དེ་དག་འདོད་པ་བཞིན་དུ་ཤིང་རླུང་གིས་བཏབ་པ་འམ། ཕྱི་ནང་གི་དངོས་པོ་དག་ལས་འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་སྒྲ་དང་། མཚན་མ་མེད་པའི་སྒྲ་དང་། སྨོན་པ་མེད་པའི་སྒྲ་དང་། མི་སྐྱེ་མི་འགོག་པའི་སྒྲ་དང་།
en: On the other hand, in accordance with the wishes of all those beings, the sound of emptiness, the sound of signlessness, the sound of wishlessness, the sound of nonarising and nonceasing, the sound of the nonessential nature of all phenomena, and the sound of all phenomena that are empty of all phenomena will emerge from the rustling of trees by the wind and from external and internal objects, as will the expression that the essential nature of all phenomena is definitively devoid of essential nature. ‘

source: ཆོས་ཐམས་ཅད་ངོ་བོ་ཉིད་མེད་པའི་སྒྲ་དང་། ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་པའི་སྒྲ་འབྱུང་བ་དང་། ཆོས་དེ་དག་གི་ངོ་བོ་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་ངོ་བོ་ཉིད་མེད་པའི་སྒྲ་དང་། དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་དེ་བཞིན་གཤེགས་པ་རྣམས་མ་བྱུང་ཡང་རུང་སྟེ། ཆོས་ཐམས་ཅད་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ངོ་།
en: Whether the tathāgatas appear, or whether the tathāgatas do not appear, all phenomena are empty of all phenomena.

source: །གང་སྟོང་པ་དེ་ལ་ནི་མཚན་མ་མེད་དོ།
en: That which is empty is signless, and that which is signless is wishless.’

source: །གང་ལ་མཚན་མ་མེད་པ་དེ་ལ་ནི་སྨོན་པ་མེད་དོ་ཞེས་བྱ་བར་ཆོས་བསྟན་པའི་སྒྲ་ཉིན་མཚན་རྒྱུན་མི་འཆད་པར་འགྲོ་ཡང་རུང་། འདུག་ཀྱང་རུང་སྡོད་ཀྱང་རུང་ཉལ་ཡང་རུང་སྟེ།
en: Day and night, the sound of the teaching of the Dharma in expressions such as these will emerge without interruption and at all times, whether they are walking, whether they are standing, whether they are sitting, or whether they are lying down.

source: རྟག་ཏུ་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུར་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་ངོ་།
en: It is in that manner that they will refine the buddhafields. “

source: །དེ་ལྟ་བུའི་སངས་རྒྱས་ཀྱི་ཞིང་དེར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དག་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ལེགས་པར་བརྗོད་པར་འགྱུར་ཏེ།
en: And in such buddhafields, once these [bodhisattvas] have indeed attained consummate buddhahood in unsurpassed, complete enlightenment, all the lord buddhas present in the world systems of the ten directions will speak in praise of them as tathāgatas, arhats, completely awakened buddhas. {

source: སེམས་ཅན་གང་གིས་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་ཐོས་པ་དེ་ཐམས་ཅད་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་ཏེ།
en: Ki.VIII: 130} All beings who hear the name of these [new] tathāgatas will certainly attain unsurpassed, complete enlightenment.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེས་ཆོས་བསྟན་ན། སེམས་ཅན་གང་ཡང་འདི་ནི་ཆོས་སོ། །འདི་ནི་ཆོས་མ་ཡིན་ཞེས་བྱ་བར་ཐེ་ཚོམ་ཟ་བར་མི་འགྱུར་རོ།
en: And when these [new] tathāgatas, arhats, completely awakened buddhas teach the Dharma, no beings will hesitate, wondering whether this is the Dharma, or whether this is not the Dharma.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད་གང་ཡིན་པ་དེ་ལ་ནི་ཆོས་མ་ཡིན་པ་གང་ཡང་མེད་དོ་ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་སོ།
en: If you ask why, it is because in the reality of phenomena, there is nothing at all that is not the Dharma. All phenomena indeed constitute the Dharma. “

source: །དེ་ལ་སེམས་ཅན་གང་མི་དགེ་བའི་རྩ་བས་ནོན་པ་དང་སངས་རྒྱས་སམ། སངས་རྒྱས་ཀྱི་ཉན་ཐོས་རྣམས་ལ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད་པ་མི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ། བདག་ཏུ་ལྟ་བར་བྱིང་བ་ནས་ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཀྱི་བར་དུ་བྱིང་བ་རྟག་པ་འམ། ཆད་པའི་མཐའ་ལ་གནས་པ་ལོག་པར་འཛིན་པས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་ཡིན་པ་ལ་ནི།
en: In this regard, those beings who are overwhelmed by the roots of nonvirtuous action and who have not developed the roots of virtuous action under [the guidance of] the buddhas or śrāvakas of the buddhas, and who have been guided by nonvirtuous associates, will be submerged within the view of self and they will be submerged within all other aspects of false view, settling in the extreme of eternalism or nihilism.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡིན་པར་འདུ་ཤེས་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡིན་པ་ལ་ནི། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མ་ཡིན་པར་འདུ་ཤེས་པ་དེ་དག་ནི་ཆོས་མ་ཡིན་པ་ལ་ཡང་ཆོས་སོ་ཞེས་ཟེར།
en: Gripped by misapprehension, they have the notion that those who are not completely awakened buddhas are completely awakened buddhas, and the notion that those who are completely awakened buddhas are not completely awakened buddhas.

source: ཆོས་ཡིན་པ་ལ་ཡང་ཆོས་མ་ཡིན་ནོ་ཞེས་ཟེར་ཏེ། དེ་དག་ཆོས་ལ་སྤོང་བར་འགྱུར་ཏེ།
en: They profess that that which is not the Dharma is the Dharma, and that that which is the Dharma is not the Dharma.

source: དེ་ལྟར་ཆོས་སྤངས་ནས་ལུས་ཞིག་པའི་འོག་ཏུ་ཤི་ནས། ངན་སོང་དང་། ངན་འགྲོ་དང་། ལོག་པར་ལྟུང་བ་དང་། སེམས་ཅན་དམྱལ་བ་དག་ཏུ་སྐྱེ་བར་འགྱུར་ཏེ།
en: They will abandon the Dharma, and having abandoned the Dharma in that manner, after they have passed away, they will through their errors fall into lower realms, inferior states of existence, and they will be reborn in the hells.

source: དེ་ལྟ་བུ་དག་ལ་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཤིང་། འཁོར་བའི་ཁོངས་སུ་ཆུད་པའི་སེམས་ཅན་དེ་དག་སྡིག་པར་ལྟ་བའི་རྣམ་པ་དེ་དག་ལས་རྣམ་པར་འགྲོལ་ཏེ། དེ་ལྟར་རྣམ་པར་དཀྲོལ་ནས་ངེས་པའི་ཕུང་པོར་རབ་ཏུ་འགོད་དེ།
en: For the sake of such individuals, the lord buddhas, having attained consummate buddhahood in unsurpassed, complete enlightenment, will liberate those beings embroiled in cyclic existence from those aspects of negative view, and having freed them in that manner, will establish them in the category of those whose receptivity is certain.

source: དེར་བཀོད་པའི་རྣམས་ཕྱིན་ཆད་ངན་སོང་དུ་ལྟུང་བར་མི་འགྱུར་རོ།
en: Those who are established in it will thenceforth not fall into inferior realms.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་པ་ཡིན་ཏེ། དེ་ལྟར་ཡོངས་སུ་སྦྱངས་པས་སེམས་ཅན་རྣམས་འཇིག་རྟེན་པའི་ཆོས་སམ། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སམ།
en: Subhūti, it is in this manner that bodhisattva great beings refine the buddhafields.

source: ཟག་པ་དང་བཅས་པའི་ཆོས་སམ། ཟག་པ་མེད་པའི་ཆོས་སམ། འདུས་བྱས་ཀྱི་ཆོས་སམ། འདུས་མ་བྱས་ཀྱི་ཆོས་གང་ལ་ཡང་གནས་པར་མི་འགྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་ཏུ་ངེས་པར་འགྱུར་རོ།
en: In consequence of having refined them accordingly, beings will not find stability in anything at all, whether mundane phenomena, supramundane phenomena, contaminated phenomena, uncontaminated phenomena, conditioned phenomena, or unconditioned phenomena, until they definitively attain unsurpassed, complete enlightenment.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་དྲུག་ཅུ་དྲུག་གོ། །།
en: This completes the sixty-sixth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངེས་ཞེས་བགྱི་འམ། མ་ངེས་ཞེས་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Chapter 67 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, are bodhisattva great beings certain to progress or is their progress uncertain?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ངེས་པ་སྟེ། མ་ངེས་པ་མ་ཡིན་ནོ། །གསོལ་པ།
en: Bodhisattva great beings are certain to progress, their progress is not uncertain,” replied the Blessed One. “

source: ཉན་ཐོས་ཀྱི་ཕུང་པོ་འམ། རང་སངས་རྒྱས་ཀྱི་ཕུང་པོ་འམ། སངས་རྒྱས་ཀྱི་ཕུང་པོ་འམ། ཕུང་པོ་གང་དུ་ངེས་པ་ལགས།
en: Are they certain to progress in the category of the śrāvakas, in the category of the pratyekabuddhas, in the category of the buddhas, or in what category?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཉན་ཐོས་ཀྱི་ཕུང་པོར་ངེས་པ་འམ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings are not certain to progress in the category of the śrāvakas.

source: རང་སངས་རྒྱས་ཀྱི་ཕུང་པོར་ངེས་པ་མ་ཡིན་གྱི།
en: They are not certain to progress in the category of the pratyekabuddhas.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སངས་རྒྱས་ཀྱི་ཕུང་པོར་ངེས་པའོ། །གསོལ་པ།
en: But, Subhūti, bodhisattva great beings are certain to progress in the category of the buddhas.” “

source: བཅོམ་ལྡན་འདས་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངེས་ཤེས་བགྱི་འམ།
en: Blessed Lord, are bodhisattva great beings who have first begun to set their mind on enlightenment certain to progress, {Ki.

source: འོན་ཏམ་ཕྱིར་མི་ལྡོག་པ་ངེས་ཤེས་བགྱི་འམ། འོན་ཏེ་སྲིད་པ་ཐ་མ་པ་ངེས་ཤེས་བགྱི།
en: VIII: 131} or else are irreversible bodhisattvas certain to progress?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ངེས་པའོ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings who have initially set their minds on enlightenment are certain to progress.

source: །ཕྱིར་མི་ལྡོག་པ་ནི་ངེས་པའོ།
en: Irreversible bodhisattvas are also certain to progress.

source: །སྲིད་པ་གཅིག་གིས་ཐོགས་པ་ནི་ངེས་པའོ། །གསོལ་པ།
en: Those who are impeded by only a single rebirth are also certain to progress.” “

source: བཅོམ་ལྡན་འདས་ངེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ངན་སོང་རྣམས་སུ་སྐྱེ་བར་འགྱུར་རམ་མི་འགྱུར།
en: Blessed Lord, will bodhisattva great beings who are certain to progress be reborn in the inferior realms?” “No, Subhūti!”

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ཏེ། རབ་འབྱོར་ངེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ངན་སོང་དུ་མི་སྐྱེའོ།
en: Subhūti, bodhisattva great beings who are certain to progress will not be reborn in the inferior realms!

source: །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བརྒྱད་པ་འམ་རྒྱུན་དུ་ཞུགས་པ་འམ་ལན་ཅིག་ཕྱིར་འོང་བ་འམ། ཕྱིར་མི་འོང་བ་འམ། དགྲ་བཅོམ་པ་འམ། རང་སངས་རྒྱས་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་རམ།
en: Subhūti, do you think that one who is on the eighth-lowest level, one who has entered the stream to nirvāṇa, one who is destined for only one more rebirth, one who is no longer subject to rebirth, an arhat, or a pratyekabuddha will be reborn in the inferior realms?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྦྱིན་པ་གཏོང་བ་དང་།
en: No, Blessed Lord!” “

source: ཚུལ་ཁྲིམས་སྲུང་བ་དང་བཟོད་པ་སྒྲུབ་པ་དང་། བརྩོན་འགྲུས་རྩོམ་པ་དང་། ཏིང་ངེ་འཛིན་ལ་སྙོམས་པར་འཇུག་པ་དང་། ཤེས་རབ་སྒོམ་པ་དང་། མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤང་བའི་དོན་དུ་གནས་པ་དེ་ནི་ངན་སོང་དུ་སྐྱེ་བར་འགྱུར་བའི་གནས་མེད་དོ།
en: Similarly, Subhūti,” continued the Blessed One, “it is impossible that bodhisattva great beings who, from the time when they first begin to set their mind on enlightenment, dispense generosity, maintain ethical discipline, practice tolerance, undertake acts of perseverance, are absorbed in meditative stability, cultivate wisdom, and are settled on abandoning all nonvirtuous attributes should be reborn in the inferior realms.

source: །ལྷ་ཚེ་རིང་པོར་སྐྱེ་བའི་གནས་མེད་དོ། །གང་ན་དགེ་བའི་ཆོས་རྣམས་མི་སྤྱོད་པ་དེ་ལྟ་བུར་སྐྱེ་བའི་གནས་མེད་དོ།
en: It is impossible that they should be reborn among long-lived gods!

source: །གླེན་པ་དང་ལྐུགས་པར་འགྱུར་བའི་ཡུལ་དུ་སྐྱེ་བའི་གནས་མེད་དོ།
en: It is impossible that they should be reborn as mentally handicapped or dumb individuals.

source: །མཐའ་འཁོབ་ཀྱི་ཀླ་ཀློ་དང་མི་སྲུན་ཅིང་འཁོར་བཞིར་རྒྱུར་མེད་པའི་ཡུལ་དུ་སྐྱེ་བའི་གནས་མེད་དོ།
en: It is impossible that they should be reborn among barbarous frontier tribesmen who are unruly, living in places where the four assemblies [of monks, nuns, laymen, and laywomen] are unknown.

source: །ལོག་པར་ལྟ་བའི་རིགས་སུ་སྐྱེ་བའི་གནས་མེད་དོ། །གང་ན་སངས་རྒྱས་ཀྱི་སྒྲ་མི་གྲག་པ་དང་། ཆོས་ཀྱི་སྒྲ་མི་གྲག་པ་དང་། དགེ་འདུན་གྱི་སྒྲ་མི་གྲག་པ་དེ་ལྟ་བུར་སྐྱེ་བའི་གནས་མེད་དོ།
en: It is impossible for them to be reborn in such places where even the word buddha is not heard, where even the word Dharma is not heard, and where even the word saṅgha is not heard.

source: །བྱ་བ་མ་ཡིན་པའི་ལྟ་བར་ལྟུང་བའི་གནས་མེད་དོ།
en: It is impossible for them to fall into the false view of inaction.

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལྷག་པའི་བསམ་པས་ཡང་དག་པར་ཞུགས་པ་ནི་མི་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་སྤྱོད་ཅེས་བྱ་བའི་གནས་མེད་དོ། །གསོལ་པ།
en: Subhūti, it is impossible that bodhisattva great beings who, commencing from the time when they first begin to set their mind on enlightenment, entering upon unsurpassed, complete enlightenment with higher aspiration, should adopt the ways of the ten nonvirtuous actions!” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ངེས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟ་བུའི་དགེ་བའི་རྩ་བ་དང་ལྡན་ཞིང་ཚུལ་དང་མི་འདྲ་བའི་གནས་སུ་མི་སྐྱེ་བ་ལགས་ན། གང་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱང་བྱོལ་སོང་གི་རྒྱུད་དུ་སྐྱེས་པའི་རབས་བསྟན་ན།
en: Blessed Lord, if bodhisattva great beings are endowed with the roots of such virtuous actions and they are not reborn in incomparably inferior places, why did the Tathāgata disclose his own past lives in the animal realm?

source: དེའི་ཚེ་དགེ་བའི་རྩ་བ་དེ་དག་གང་དུ་མཆིས།
en: Where did those roots of virtuous action go on such occasions?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མི་དགེ་བའི་ལས་ཀྱིས་བྱོལ་སོང་གི་རྒྱུད་དུ་སྐྱེ་བ་མ་ཡིན་གྱི།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings are not reborn in the animal realms due to nonvirtuous past actions, {Ki.

source: ལུས་གང་དང་གང་གིས་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་འགྱུར་བ་དེ་དང་དེ་ལྟ་བུའི་ལུས་ཆེད་དུ་བསམས་ཤིང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་ཡོངས་སུ་འཛིན་ཀྱང་།
en: VIII: 132} but for the sake of beings they voluntarily assume such corporeal forms by which they might be of benefit to beings.

source: རབ་འབྱོར་དེ་ལྟར་ཐབས་མཁས་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེས་ཤིང་དེ་ལ་ལ་ལ་ཞིག་གསོད་དུ་འོངས་ཀྱང་བླ་ན་མེད་པའི་བཟོད་པས་བདག་ཡོངས་སུ་གཏོང་ཞིང་སེམས་ཅན་དེ་དག་ལ་གནོད་པར་མི་བྱེད་པ་དེ་ལྟ་བུའི་ཐབས་མཁས་པ་དག་དགྲ་བཅོམ་པ་འམ་རང་སངས་རྒྱས་དག་ལ་ཡོད་དམ།
en: Subhūti, bodhisattva great beings are endowed in that manner with skill in means whereby they may take birth in the animal realms, sacrifice themselves through their unsurpassed tolerance, even when some [creatures] come to kill them, and avoid harming those beings. Do śrāvakas or pratyekabuddhas have such skill in means?

source: རབ་འབྱོར་དེ་བས་ན་རྣམ་གྲངས་དེས་ཀྱང་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དོན་དུ་སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་རྫོགས་པར་བྱེད་ཅིང་། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེ་ཡང་། བྱོལ་སོང་གི་སྐྱེ་གནས་ཀྱི་རྒྱུད་ཀྱི་ཉེས་པས་མི་གོས་པར་རིག་པར་བྱའོ།
en: Therefore those, Subhūti, are the formulations explaining how bodhisattva great beings perfect great compassion for the sake of unsurpassed, complete enlightenment on behalf of beings, and, even though they are reborn in the animal realms, you should know that they are untainted by the defects of life in the animal realm.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་དགེ་བའི་ཆོས་གང་ལ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟ་བུའི་ལུས་ཡོངས་སུ་འཛིན།
en: Blessed Lord, maintaining which virtuous attributes do bodhisattva great beings acquire such corporeal forms?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཡོངས་སུ་རྫོགས་པར་མི་བྱ་བའི་དགེ་བའི་ཆོས་དེ་ལྟ་བུ་གང་ཡང་མེད་དེ།
en: Subhūti,” replied the Blessed One, “there are no virtuous attributes at all that bodhisattva great beings should not perfect.

source: དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྟེ།
en: Unsurpassed, complete enlightenment is the perfection of all virtuous attributes.

source: དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ་སྙིང་པོ་བྱང་ཆུབ་ལ་འདུག་གི་བར་དུ་དགེ་བའི་ཆོས་གང་ཡང་ཡོངས་སུ་རྫོགས་པར་མི་བྱ་བ་མེད་དོ།
en: Therefore, there is no virtuous attribute at all that should not be perfected by bodhisattva great beings, commencing from when they first begin to set their mind on enlightenment, until they are seated at the site of enlightenment.

source: །དགེ་བའི་ཆོས་གང་ཡང་ཡོངས་སུ་རྫོགས་པར་མ་བྱས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དེ་ལྟ་བུ་མེད་དེ།
en: They do not attain consummate buddhahood in unsurpassed, complete enlightenment while any virtuous attributes are unperfected.

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། དགེ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བ་ལ་བསླབ་པར་བྱ་སྟེ་དེ་ལ་བསླབས་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་འཐོབ་བོ།
en: So it is, Subhūti, that from the time when they first begin to set their mind on enlightenment, bodhisattva great beings should train in perfecting all virtuous attributes. When they have trained in it, they will attain all-aspect omniscience.

source: །བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་སྤོང་ངོ་།
en: They will also abandon all reincarnation through the continuity of propensities.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འཕགས་པའི་ཆོས་དཀར་པོ་ཟག་པ་མ་མཆིས་པ་དེ་ལྟ་བུ་དང་ལྡན་པའང་ངན་སོང་ངམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་སྐྱེ་བར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how are bodhisattva great beings who possess such positive attributes of sublime beings, free from contaminants, born in the inferior realms or in the animal realm?” “

source: རབ་འབྱོར་དེ་བཞིན་གཤེགས་པ་འཕགས་པ་ཟག་པ་མེད་པ་ཡིན་ནམ།
en: Subhūti, are the tathāgatas sublime and without contaminants?”

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལགས་སོ།
en: Yes, Blessed Lord, it is so!

source: །བདེ་བར་གཤེགས་པ་དེ་དེ་ལགས་ཏེ།
en: Venerable Sugata, it is so!

source: དེ་བཞིན་གཤེགས་པ་ནི་འཕགས་ཤིང་ཟག་པ་མི་མངའ་བའོ།
en: The tathāgatas are sublime and they are without contaminants.” “
